Documents/РасходСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РасходСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоПрогноз</Name>
					<Comment>означает, что этот документ - планируемый, т.е.вместо него будет введе другой документ, не обязательно с такими же параметрами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммыВТабЧасти</Name>
					<Comment>истина-используется таб часть, ложь-реквизит шапки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияПоНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>для недельного планирования</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БюджетГод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьОвер</Name>
					<Comment>иногда надо провести не в кредит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоходыРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БДР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>БДР</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Comment>только в валюте регл учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Comment>только в валюте регл учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактПрогноз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>сумма в валюте кошелька</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогноз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогнозРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>флВнутреннее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РасходСредств/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Попытка
		ДатаЗапрета = Константы.ДатаЗапретаРедактирования.Получить();
		Если ЗначениеЗаполнено(ДатаЗапрета) Тогда
			Если Дата <= ДатаЗапрета Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;

		//регитр БДР
		Если Кошелек.КредитнаяКарта И НЕ НеПроводитьОвер Тогда	
			Если ЗначениеЗаполнено(Кошелек.СтатьяКредитПолученный) Тогда
				//если статья кредита заполнена, то надо отразить взятие кредита в доходах
				ОбщийМодуль1Сервер.ДвижениеБДРФакт(
					Движения.БДР, 
					Кошелек.СтатьяКредитПолученный, 
					ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(?(СуммыВТабЧасти, 
					ДоходыРасходы.Итог("Сумма")+ДоходыРасходы.Итог("ДопСумма")
					, Сумма), Валюта, Курс, Кратность), 
					Дата,,,,ЭтоПрогноз);
			Иначе
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обязательно укажите статью для полученных кредитов в кошельке!");
							
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Если СуммыВТабЧасти Тогда
			Если ДетализацияПоНоменклатуре Тогда
			
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТабЧасть.СтатьяДР КАК СтатьяДР,
				|	ТабЧасть.Номенклатура КАК Номенклатура,
				|	Шапка.Контрагент,
				|	СУММА(ТабЧасть.Сумма+ТабЧасть.ДопСумма) КАК Сумма,
				|	ТабЧасть.Проект
				|ИЗ
				|	Документ.РасходСредств.ДоходыРасходы КАК ТабЧасть
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСредств КАК Шапка
				|		ПО (Шапка.Ссылка = ТабЧасть.Ссылка)
				|ГДЕ
				|	ТабЧасть.Ссылка = &Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ТабЧасть.СтатьяДР,
				|	ТабЧасть.Номенклатура,
				|	Шапка.Контрагент,
				|	ТабЧасть.Проект";
		   		Выборка = Запрос.Выполнить().Выбрать();

				Пока Выборка.Следующий() Цикл
					Если Выборка.СтатьяДР=Справочники.СтатьиДоходовРасходов.ПустаяСсылка() Тогда
						Продолжить;
					КонецЕсли;
					ОбщийМодуль1Сервер.ДвижениеБДРФакт(Движения.БДР, 
						Выборка.СтатьяДР, 
						ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(Выборка.Сумма, Валюта, Курс, Кратность), 
						Дата,
						Выборка.Номенклатура,
						Выборка.Контрагент,
						?(ЗначениеЗаполнено(Выборка.Проект) или Выборка.Проект<>Справочники.Проекты.ПустаяСсылка(),
						Выборка.проект, Проект),
						ЭтоПрогноз);
				КонецЦикла;
			Иначе
				//суммы в тч, детализации нет
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТабЧасть.СтатьяДР КАК СтатьяДР,
				|	СУММА(ТабЧасть.Сумма+ТабЧасть.ДопСумма) КАК Сумма,
				|	ТабЧасть.Проект
				|ИЗ
				|	Документ.РасходСредств.ДоходыРасходы КАК ТабЧасть
				|ГДЕ
				|	ТабЧасть.Ссылка = &Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ТабЧасть.СтатьяДР,
				|	ТабЧасть.Проект";
				Выборка = Запрос.Выполнить().Выбрать();

				Пока Выборка.Следующий() Цикл
					Если Выборка.СтатьяДР=Справочники.СтатьиДоходовРасходов.ПустаяСсылка() Тогда
						Продолжить;
					КонецЕсли;
					ОбщийМодуль1Сервер.ДвижениеБДРФакт(Движения.БДР, 
						Выборка.СтатьяДР, 
						ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(Выборка.Сумма, Валюта, Курс, Кратность), 
						Дата,,,
						?(ЗначениеЗаполнено(Выборка.Проект) или Выборка.Проект<>Справочники.Проекты.ПустаяСсылка(),
						Выборка.проект, Проект),
						ЭтоПрогноз);
				КонецЦикла;
	    	КонецЕсли;
		Иначе
			//суммы не в тч
			ОбщийМодуль1Сервер.ДвижениеБДРФакт(Движения.БДР, 
			СтатьяДР, 
			ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(?(СуммыВТабЧасти, 
			ДоходыРасходы.Итог("Сумма")+ДоходыРасходы.Итог("ДопСумма")
			, Сумма), Валюта, Курс, Кратность), 
			Дата,,,Проект,ЭтоПрогноз);

		КонецЕсли;
		
		
		//прог 24 02 13. нельзя менять порядок. движение по РН ДенежныеСредства должно быть в самом конце!
		// регистр ДенежныеСредства Расход
		ОбщийМодуль1Сервер.ДвижениеДенежныхСредств(
					Движения.ДенежныеСредства, 
					ВидДвиженияНакопления.Расход, 
					Дата, 
					Кошелек, 
					?(СуммыВТабЧасти, 
					ДоходыРасходы.Итог("Сумма")+ДоходыРасходы.Итог("ДопСумма")
					, Сумма), 
					Валюта, Курс, Кратность, ЭтоПрогноз);
					
					
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка проведения", УровеньЖурналаРегистрации.Ошибка, , ссылка, ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если СуммыВТабЧасти Тогда
		
		Сумма=ДоходыРасходы.Итог("Сумма");
		
		Если ДетализацияПоНоменклатуре Тогда
			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран контрагент!");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОбъектКопирования,,"Номер,Дата");	
КонецПроцедуры

Процедура ПриИзмененииКошелька() Экспорт

	Валюта = Кошелек.Валюта;
	КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
	Курс = КурсКратность.Курс;
	Кратность = КурсКратность.Кратность;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	//НеРегистрироватьВПланеОбмена = Неопределено;
	//ДополнительныеСвойства.Свойство("НеРегистрироватьВПланеОбмена", НеРегистрироватьВПланеОбмена);
	//Если НеРегистрироватьВПланеОбмена <> Истина Тогда //только сравнение с истиной!
	//	Узел = ПланыОбмена.ОбменСAndroid.НайтиПоКоду("02");
	//	Если Узел <> ПланыОбмена.ОбменСAndroid.ПустаяСсылка() Тогда
	//		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
	//	КонецЕсли;
	//КонецЕсли;

	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Попытка
		Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
			Возврат
		КонецЕсли;
		Для Каждого Движение Из Движения Цикл
			Движение.Отбор.Регистратор.Установить(Ссылка);
			Движение.Очистить();
			Движение.Записать();
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка удаления проведения", УровеньЖурналаРегистрации.Ошибка, , ссылка, ОписаниеОшибки());
	КонецПопытки;		
КонецПроцедуры
